{"organizations": [], "uuid": "84597cd57d96f00e361c56aeba6b545c932a70ae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/03/15/globe-newswire-checkpoint-therapeutics-announces-preclinical-data-presentation-at-the-2018-american-association-for-cancer-research-annual.html", "country": "US", "domain_rank": 767, "title": "Checkpoint Therapeutics Announces Preclinical Data Presentation at the 2018 American Association for Cancer Research Annual Meeting", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.007, "site_type": "news", "published": "2018-03-15T14:30:00.000+02:00", "replies_count": 0, "uuid": "84597cd57d96f00e361c56aeba6b545c932a70ae"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/03/15/globe-newswire-checkpoint-therapeutics-announces-preclinical-data-presentation-at-the-2018-american-association-for-cancer-research-annual.html", "ord_in_thread": 0, "title": "Checkpoint Therapeutics Announces Preclinical Data Presentation at the 2018 American Association for Cancer Research Annual Meeting", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "mccormick place south", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}], "organizations": [{"name": "american association for cancer research annual meeting", "sentiment": "neutral"}, {"name": "checkpoint therapeutics, inc.", "sentiment": "neutral"}, {"name": "bet", "sentiment": "none"}, {"name": "molecular therapeutics / canonical targets", "sentiment": "none"}, {"name": "american association for cancer research", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, March 15, 2018 (GLOBE NEWSWIRE) -- Checkpoint Therapeutics, Inc. (“Checkpoint”) (NASDAQ:CKPT), a clinical-stage, immuno-oncology biopharmaceutical company focused on the acquisition, development and commercialization of novel treatments for patients with solid tumor cancers, today announced that preclinical data on its BET inhibitor CK-103 (also known as TG-1601) will be presented in a poster session at the American Association for Cancer Research (AACR) Annual Meeting to be held April 14 - 18, 2018, in Chicago.\nDetails on the poster presentation are as follows:\nTitle : TG-1601 is a novel BET inhibitor with strong binding affinity and long-lasting effect in pre-clinical models Poster Session: Experimental and Molecular Therapeutics / Canonical Targets 2 Abstract Number: 5790 Poster Number: 16 Date and Time: Wednesday, April 18, 2018, 8 a.m. – 12 p.m. CDT Location: McCormick Place South, Exhibit Hall A, Poster Section 36 Following the presentation, the poster will be available on the Publications page of the Pipeline section of Checkpoint’s website, www.checkpointtx.com .\nAdditional information on the meeting can be found on the AACR website www.aacr.org .\nAbout Checkpoint Therapeutics\nCheckpoint Therapeutics, Inc. (“Checkpoint”) is a clinical-stage, immuno-oncology biopharmaceutical company focused on the acquisition, development and commercialization of novel treatments for patients with solid tumor cancers. Checkpoint is currently evaluating its lead product candidate, CK-301, an anti-PD-L1 antibody licensed from the Dana-Farber Cancer Institute, in a Phase 1 clinical trial in checkpoint therapy-naïve patients with selected recurrent or metastatic cancers. Checkpoint plans to develop CK-301 as a treatment for patients with non-small cell lung cancer (“NSCLC”) and other solid tumors. In addition, Checkpoint is evaluating its small-molecule, targeted anti-cancer agent, CK-101, in the Phase 1 portion of a Phase 1/2 clinical trial for the treatment of patients with epidermal growth factor receptor (“EGFR”) mutation-positive NSCLC. Checkpoint’s pipeline also includes antibodies that target glucocorticoid-induced TNFR-related protein (“GITR”) and carbonic anhydrase IX (“CAIX”), in addition to oral, small-molecule, targeted anti-cancer agents that inhibit bromodomain and extra-terminal (“BET”) proteins and poly (ADP-ribose) polymerase (“PARP”). Checkpoint is a majority-controlled subsidiary of Fortress Biotech, Inc., and is headquartered in New York City. For more information, visit www.checkpointtx.com .\nAbout Fortress Biotech\nFortress Biotech, Inc. (“Fortress”) (NASDAQ:FBIO) is a biopharmaceutical company dedicated to acquiring, developing and commercializing novel pharmaceutical and biotechnology products. Fortress develops and commercializes products both within Fortress and through certain of its subsidiary companies, also known as Fortress Companies. In addition to its internal development programs, Fortress leverages its biopharmaceutical business expertise and drug development capabilities and provides funding and management services to help the Fortress Companies achieve their goals. Fortress and the Fortress Companies may seek licensing arrangements, acquisitions, partnerships, joint ventures and/or public and private financings to accelerate and provide additional funding to support their research and development programs. For more information, visit www.fortressbiotech.com .\nForward‐Looking Statements\nThis press release may contain “forward-looking statements” within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934, each as amended. Such statements include, but are not limited to, any statements relating to our growth strategy and product development programs and any other statements that are not historical facts. Forward-looking statements are based on management’s current expectations and are subject to risks and uncertainties that could negatively affect our business, operating results, financial condition and stock value. Factors that could cause actual results to differ materially from those currently anticipated include: risks relating to our growth strategy; our ability to obtain, perform under and maintain financing and strategic agreements and relationships; risks relating to the results of research and development activities; risks relating to the timing of starting and completing clinical trials; uncertainties relating to preclinical and clinical testing; our dependence on third-party suppliers; our ability to attract, integrate and retain key personnel; the early stage of products under development; our need for substantial additional funds; government regulation; patent and intellectual property matters; competition; as well as other risks described in our SEC filings. We expressly disclaim any obligation or undertaking to release publicly any updates or revisions to any forward-looking statements contained herein to reflect any change in our expectations or any changes in events, conditions or circumstances on which any such statement is based, except as required by law.\nCompany Contact:\nJaclyn Jaffe\nCheckpoint Therapeutics, Inc.\n(781) 652-4500\nir@checkpointtx.com\nInvestor Relations Contact:\nJeremy Feffer\nManaging Director, LifeSci Advisors, LLC\n(212) 915-2568\njeremy@lifesciadvisors.com\nMedia Relations Contact:\nLaura Bagby\n6 Degrees\n(312) 448-8098\nlbagby@6degreespr.com\nSource:Checkpoint Therapeutics, Inc", "external_links": ["http://www.abstractsonline.com/pp8/#!/4562/presentation/6820", "https://www.globenewswire.com/Tracker?data=TqyK8aqLyAz8A1FBhvb2aCpaLhV-HLFkLgAtyupuBVynhOz1Mw3KPvZ5fP_Gh-m_QSJil66kVLsJpSuXFCMd6-aBztr-bn0ez4ZiiLnhvys=", "https://www.globenewswire.com/Tracker?data=rx52NN2J3QdAETALDLBeQgFsAIJmH5jP4LCJz6YnJjKtzL-oeamRki9JITJMgLgbk5GUT86YcqCcQGy-AW9XkK75m57NjVHnxlSgKApIh7U=", "https://www.globenewswire.com/Tracker?data=horWd1ja8ggfDLTNGtFm4Vj7VhVQw43MPmdox399CU569PpbfdK1mMBDxU3hSyzPf8kq5Tp4tY4b4j5if-k1u8dKTajTPMEalDFCo8HBL8w=", "https://www.globenewswire.com/Tracker?data=TqyK8aqLyAz8A1FBhvb2aAoDbM9NhtsGEAMTAEOZyHBco_MZDQFzEutoaGXPRuLtHQctSnNJlX2TC3wuxDsOnYeOHaxeN9L2QtMq-V3ml1o=", "https://www.globenewswire.com/Tracker?data=rrx7ud0ngkOTLE8TZ55kVrOlVVvJGUJsIFXRSpfF9wnbo6QZShBPSD_itwK6w9uh4XmWehpPinzf4As8-ZLUmRfyH6IbEUDBPe-J4SVZIM12Bm3FFVh3aY9K3fEu9Wxf", "https://www.globenewswire.com/Tracker?data=tTpaxvUU_dt36sj-aSlWXTcmYxKY9yTkLFXskZZdB3ks8dDCocfCcs-SZPX4HSYT9r7COV-erpU_-DHKRmcjw3fNbmav9zSUPGuB5qn5WUg=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/067475f8-416e-4d5f-a60f-26b19ea068dd", "https://www.globenewswire.com/Tracker?data=2qlnCZIzFIrKEb0K0L7yAPuzsTpm0BSh35LBezuQYRUaK7Ky0XT6TrJ3XRn_agT7N9FPTzHqbiDfxn93H71PXw=="], "published": "2018-03-15T14:30:00.000+02:00", "crawled": "2018-03-15T18:21:59.000+02:00", "highlightTitle": ""}