{"organizations": [], "uuid": "fe985e3858ebfd5e6c4af8149ce164d19b409bf8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180315&t=2&i=1241231056&w=1200&r=LYNXNPEE2E14G", "site_section": "http://feeds.reuters.com/reuters/worldNews/", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-hungary-election-rallies/tens-of-thousands-march-to-back-hungarys-nationalist-pm-before-vote-idUSKCN1GR1U6", "country": "US", "domain_rank": 408, "title": "Tens of thousands march to back Hungary's nationalist PM before vote", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-15T15:07:00.000+02:00", "replies_count": 0, "uuid": "fe985e3858ebfd5e6c4af8149ce164d19b409bf8"}, "author": "", "url": "https://www.reuters.com/article/us-hungary-election-rallies/tens-of-thousands-march-to-back-hungarys-nationalist-pm-before-vote-idUSKCN1GR1U6", "ord_in_thread": 0, "title": "Tens of thousands march to back Hungary's nationalist PM before vote", "locations": [], "entities": {"persons": [{"name": "margaret", "sentiment": "none"}, {"name": "viktor", "sentiment": "none"}, {"name": "viktor orban", "sentiment": "none"}, {"name": "habsburg", "sentiment": "none"}], "locations": [{"name": "hungary", "sentiment": "none"}, {"name": "budapest", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "danube", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "poland", "sentiment": "none"}], "organizations": [{"name": "krisztina than 3 min read budapest", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "March 15, 2018 / 1:08 PM / Updated 7 minutes ago Tens of thousands march to back Hungary's nationalist PM before vote Krisztina Than 3 Min Read BUDAPEST (Reuters) - Tens of thousands of supporters of Hungary’s right-wing Prime Minister Viktor Orban marched on Thursday to back his bid for a third term in office in April elections, many of them hailing his hardline stance on immigration. People walk on the Margaret bridge as they attend Hungarian march at a pro-Orban rally during Hungary's National Day celebrations, which also commemorates the 1848 Hungarian Revolution against the Habsburg monarchy, in Budapest, Hungary March 15, 2018. REUTERS/Bernadett Szabo They were joined by thousands of supporters of Poland’s ruling conservative PiS party - another administration on the EU’s eastern edge at odds with Brussels over migration and efforts to tighten controls over courts and media. Supporters of both parties braved the rain to walk across a bridge spanning the Danube river in Budapest carrying banners with the slogans “Hungary protects Europe” and “We are with you Viktor”. “He (Viktor Orban) is not afraid of EU’s big powers and dares to swim against the current,” said Imre Csordas, 51, wearing traditional 16th-century Hungarian clothing. “He stands up for the interest of Hungarians.” Organizers had brought people in to the capital from the countryside in fleets of buses for the march that coincided with Hungary’s national holiday commemorating its 1848 revolution. Orban was due to speak to the crowd in front of parliament. Opposition and student groups were planning a series of counter-rallies during the day. People gather at a pro-Orban rally during Hungary's National Day celebrations, which also commemorates the 1848 Hungarian Revolution against the Habsburg monarchy, in Budapest, Hungary, March 15, 2018. REUTERS/Marko Djurica “THERE IS A LOT AT STAKE” “Today, like so many times in our history, we again need to fight for our independence, for our nation, so Hungary can remain a Hungarian country and not be turned into a multicultural state,” said the Civil Forum group, which organized the “Peace March”, supported by Orban’s Fidesz party. Polish supporters gather at a pro-Orban rally during Hungary's National Day celebrations, which also commemorates the 1848 Hungarian Revolution against the Habsburg monarchy, in Budapest, Hungary, March 15, 2018. REUTERS/Marko Djurica “Luckily, for the time being, we do not need to fight with weapons ... but we must ...march and vote, as there is a lot at stake,” Zsolt Bayer, one of the founders of Fidesz, said in a video on Facebook calling on people to attend the rally. Orban and Polish Prime Minister Mateusz Morawiecki lead conservative governments under fire from Brussels over their refusal to take in migrants under a quota system. Orban’s stance has helped shore up support for Fidesz among voters but it has drawn accusations of racism from the United Nations human rights chief. His party, in power since 2010, suffered an unexpected setback at a recent municipal by-election. However, it remains well ahead of its rivals in opinion polls despite scandals around Fidesz and a recent investigation by the European Anti-Fraud Office which revealed “serious irregularities” in projects co-financed by the EU and run by a company once co-owned by Orban’s son-in-law. Reporting by Krisztina Than; Editing by Andrew Heavens", "external_links": [], "published": "2018-03-15T15:07:00.000+02:00", "crawled": "2018-03-15T15:22:49.001+02:00", "highlightTitle": ""}