{"organizations": [], "uuid": "b1b3b2427c213338500d8201f91cfa40157982b1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/03/14/globe-newswire-xunlei-announces-unaudited-financial-results-for-the-fourth-quarter-and-the-fiscal-year-ended-december-31-2017.html", "country": "US", "domain_rank": 767, "title": "Xunlei Announces Unaudited Financial Results for the Fourth Quarter and the Fiscal Year Ended December 31, 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-03-15T03:00:00.000+02:00", "replies_count": 0, "uuid": "b1b3b2427c213338500d8201f91cfa40157982b1"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/03/14/globe-newswire-xunlei-announces-unaudited-financial-results-for-the-fourth-quarter-and-the-fiscal-year-ended-december-31-2017.html", "ord_in_thread": 0, "title": "Xunlei Announces Unaudited Financial Results for the Fourth Quarter and the Fiscal Year Ended December 31, 2017", "locations": [], "entities": {"persons": [], "locations": [{"name": "shenzhen", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "nasd", "sentiment": "negative"}, {"name": "ivas", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHENZHEN, China, March 15, 2018 (GLOBE NEWSWIRE) -- Xunlei Limited (“Xunlei” or the “Company”) (Nasdaq:XNET), a leading cloud-based acceleration technology company in China, today announced its unaudited financial results for the fourth quarter and the fiscal year ended December 31, 2017.\nFourth Quarter 2017 Financial Highlights:\nTotal revenues were US$82.4 million, an 128.5% increase from the corresponding period of last year and up 83.9% from the previous quarter. Online advertising revenues (revenues primarily from mobile advertising) were US$7.8 million, a 70.6% increase from the corresponding period of last year and a 36.0% increase from the previous quarter. Other internet value-added services (“IVAS”) revenues were US$51.9 million, a 431.6% increase from the corresponding period of last year and a 184.1% increase from the previous quarter. IVAS consists of cloud computing and services other than subscription and advertising. Net income from continuing operations was US$3.0 million in the fourth quarter of 2017, compared with net loss of US$26.8 million in the previous quarter. The net loss in the previous quarter included impairment of assets in the amount of $13.6 million.\nFiscal Year Ended December, 31 2017 Financial Highlights:\nTotal revenues were US$201.9 million, a 43.2% increase from 2016. Online advertising revenues (revenues primarily from mobile advertising) were US$22.5 million, a 33.2% increase from 2016. Other internet value-added services (“IVAS”) revenues were US$94.5 million, a 178.3% increase from 2016. IVAS consists of cloud computing and services other than subscription and advertising. Net loss from continuing operations was US$44.2 million for fiscal year 2017, compared with net loss of US$30.8 million for 2016. The net loss for 2017 included impairment of assets in the amount of $13.6 million.\nRecent and Fiscal Year Developments:\nExpanded cloud computing offering from CDN domain to IaaS domain and developed solutions with OneThing Cloud nodes distributed at users' homes. Developed a proprietary \"Thunder Blockchain\" to improve blockchain performance as well as enable third parties to develop rich blockchain applications. In March and September 2017, signed contracts with a provincial branch of China Telecom and China Unicom respectively, to co-develop Smart Home based distributed CDN technology and products. Won industry awards and recognition for our efforts on and contributions to the sharing economy.\nMr. Lei Chen, Chief Executive Officer of Xunlei, commented: “We are very pleased that we achieved solid performance for the fourth quarter of 2017. Our fourth quarter revenues met our upwardly revised guidance range as our cloud computing business expanded at a fast pace during the fourth quarter of 2017. Our priority for 2018 is to gain market shares and continue to improve the bottom line.” Concluded Mr. Chen.\nFourth Quarter 2017 Financial Results\nTotal Revenues 1\nTotal revenues were US$82.4 million, increased 83.9% sequentially. The increase in total revenues on a sequential basis was mainly attributable to the growth of cloud computing businesses.\nSubscription: Revenues from subscriptions were US$22.7 million, up 9.1% and 4.5% sequentially and on a year-over-year basis, respectively. The number of subscribers 2 was 4.25 million as of December 31, 2017, up from 4.18 million as of September 30, 2017 and 4.18 million as of December 31, 2016. The average revenue per subscriber for the fourth quarter was RMB34.4, up from RMB33.2 as of September 30, 2017 and down from RMB35.7 as of December 31, 2016.\nOnline advertising (including mobile advertising): Revenues from online advertising were US$7.8 million, up 36.0% sequentially. Mobile advertising revenue increased 44.8% on sequential basis.\nIVAS: Revenues from IVAS (primarily including revenues from cloud computing) were US$51.9 million, up 431.6% on a year-over-year basis and up 184.1% sequentially. Cloud computing revenues grew by 517.2% and 225.8% on a year-over-year basis and sequentially, respectively. In the fourth quarter of 2017, the Company generated approximately US$5.8 million revenue related to the technology solution services provided to Xiaomi. Although this revenue is one-off in nature, we will continue to cooperate with Xiaomi and explore further cooperation opportunities in the future.\nCost of Revenues\nCost of revenues was US$42.0 million, representing 50.9% of total revenues.\nBandwidth costs: Bandwidth costs were US$14.7 million, representing 17.9% of total revenues, compared with US$17.1 million or 38.2% of total revenues in the previous quarter.\nGross Profit and Gross Margin\nGross profit for the fourth quarter was US$39.7 million, up 149.8% sequentially. Gross margin was 48.2%, compared with 35.5% in the previous quarter. The increase in gross profit and margin was mainly due to improved cloud computing business during the quarter.\nResearch and Development Expenses\nResearch and development expenses for the fourth quarter were US$20.6 million, representing 24.9% of total revenues, compared with US$15.5 million or 34.6% of total revenues in the previous quarter. This increase was primarily due to the increase in staff costs for the Company to maintain its competitive edge\nSales and Marketing Expenses\nSales and marketing expenses for the fourth quarter were US$7.5 million, representing 9.1% of total revenues, compared with US$5.5 million or 12.2% of total revenues in the previous quarter. The increase was primarily due to more marketing and promotion expenses incurred during the quarter.\nGeneral and Administrative Expenses\nGeneral and administrative expenses for the fourth quarter were US$7.7 million, representing 9.4% of total revenues, compared with US$13.2 million or 29.5% of total revenues in the previous quarter. The decrease was primarily due to write-offs in an aggregate amount of US$6.9 million mainly related to a business (Kankan) the company had sold before and other prior business transactions, which were one-time in nature in the previous quarter.\nImpairment of assets\nNo impairment of assets was incurred in the fourth quarter. Impairment of assets in the third quarter was US$13.6 million, accounting for 30.3% of total revenues. The amount represented assets written-offs after impairment and recoverability assessment. Approximately US$8.8 million of the assets impairment was related to the Kankan business the company had sold before and US$4.8 million related to the intangible assets from a prior acquisition of Kuaipan Personal, which were one-time in nature.\nOperating Income/( Loss )\nOperating income was US$3.9 million, compared with operating loss of US$31.8 million in the previous quarter. The prior quarter operating loss was comprised of several write-offs in an aggregate amount of US$21.8 million, of which approximately US$11.8 million was due to the Kankan business the Company sold before, US$4.8 million due to write-off of the intangible assets for a prior business acquisition of Kuaipan Personal, and US$1.3 million for accelerated depreciation of servers, which were one-time in nature.\nNet Income/( Loss ) and Earning/( Loss ) Per Share\nNet income from continuing operations was US$3.0 million in the fourth quarter of 2017, compared with net loss of US$26.8 million in the previous quarter. Non-GAAP net income from continuing operations was US$4.8 million in the fourth quarter of 2017, compared with a loss of US$24.7 million in the previous quarter. The decreased net loss from continuing operations and non-GAAP net loss from continuing operations were primarily due to increase in revenue of cloud computing business and no more write-offs as discussed above, which were one-time in nature in the previous quarter.\nDiluted income per ADS from continuing operations in the fourth quarter of 2017 was approximately US$0.05 as compared with a loss of US$0.13 in the same period last year and a loss of $0.40 in the third quarter of 2017.\nUnaudited Financial Results for the fiscal year ended December 31, 2017\nTotal Revenues\nTotal revenues were US$201.9 million, up 43.2% on a year-over-year basis. The increase in total revenues was mainly attributable to the growth of cloud computing, live video and mobile advertising businesses.\nSubscription: Revenues from subscriptions were US$85.0 million, down 5.8% on a year-over-year basis. The decrease in subscription revenues was primarily attributable to decline in the average number of subscribers during the year.\nOnline advertising (including mobile advertising): Revenues from online advertising were US$22.5 million, up 33.2% on a year-over-year basis. Mobile advertising revenues increased 46.7% on a year-over-year basis.\nIVAS: Revenues from IVAS (including revenues from cloud computing) were US$94.5 million, up 178.3% on a year-over-year basis. Cloud computing revenues grew by 223.0% on a year-over-year basis.\nCost of Revenues\nCost of revenues was US$117.9 million, representing 58.4% of total revenues.\nBandwidth costs: Bandwidth costs were US$68.4 million, representing 33.9% of total revenues, compared with US$55.1 million or 39.1% of total revenues in the previous year.\nGross Profit and Gross Margin\nGross profit for the year was US$82.7 million, up 37.2% on the year-over-year basis. Gross margin was 41.0%, compared with 42.8% in the previous year. The increase in gross profit was mainly due to improved cloud computing business and lower gross margin was due to change in the revenue structure.\nResearch and Development Expenses\nResearch and development expenses for the year were US$66.9 million, representing 33.2% of total revenues, compared with US$61.2 million or 43.4% of total revenues in the previous year. The increase was primarily due to increase in staff costs.\nSales and Marketing Expenses\nSales and marketing expenses for the year were US$19.9 million, representing 9.8% of total revenues, compared with US$14.6 million or 10.4% of total revenues in the previous year. The increase was primarily due to more marketing and promotion expenses incurred during the year as a result of more business activities.\nGeneral and Administrative Expenses\nGeneral and administrative expenses for the year were US$36.5 million, representing 18.1% of total revenues, compared with US$26.0 million or 18.4% of total revenues in the previous year. The increase was primarily due to write-offs in an aggregate amount of US$6.9 million during the year, mainly related to a business (Kankan) the company had sold before and other prior business transactions, which were one-time in nature.\nImpairment of assets\nImpairment of assets for the year was US$13.6 million, accounting for 6.7% of total revenues. The amount represented assets written-offs after impairment and recoverability assessment. Approximately US$8.8 million of the assets impairment was related to the Kankan business the Company had sold before and US$4.8 million related to the intangible assets from a prior acquisition of Kuaipan Personal, which were one-time in nature.\nOperating Loss\nOperating loss was US$54.2 million, compared with operating loss of US$41.5 million in the previous year. The increase was mainly due to several write-offs in an aggregate amount of US$21.8 million, of which approximately US$11.8 million was due to the Kankan business the company sold before, US$4.8 million due to write-off of the intangible assets for a prior business acquisition of Kuaipan Personal, and US$1.3 million for accelerated depreciation of servers, which were one-time in nature.\nNet Loss and Loss Per Share\nNet loss from continuing operations was US$44.2 million in 2017, compared with US$30.8 million in the previous year. Non-GAAP net loss from continuing operations was US$35.9 million in 2017, compared with a loss of US$21.5 million in the previous year. The increased net loss from continuing operations and non-GAAP net loss from continuing operations were primarily due to several write-offs as discussed above, which were one-time in nature.\nDiluted loss per ADS from continuing operations in 2017 was US$0.67 as compared with a loss of US$0.46 in the same period last year.\nCash Balance\nAs of December 31, 2017, the Company had cash, cash equivalents and short-term investments of US$372.4 million, compared with US$381.5 million as of December 31, 2016.\nGuidance for F irst Quarter 201 8\nFor the first quarter 2018, Xunlei estimates total revenues to be between US$81 million and US$85 million, and the midpoint of the range represents a year-over-year increase of approximately 129.3%. This estimate represents management’s preliminary view as of the date of this release, which is subject to change and any change could be material.\nConference Call Details\nXunlei's management will host a conference call at 8:00 p.m. U.S. Eastern Time on March 14, 2018 (8:00 a.m. March 15, 2018 Beijing/Hong Kong Time), to discuss its quarterly and fiscal year results and recent business activities.\nTo participate in the conference call, please dial the following number five to ten minutes prior to the scheduled conference call time:\nChina: 400-120-0654 Hong Kong: +852-3018-6776 United States: +1-855-500-8701 International: +65 6713-5440 Passcode: 4495078 The Company will also broadcast a live audio webcast of the conference call. The webcast will be available at http://ir.xunlei.com .\nFollowing the earnings conference call, an archive of the call will be available by dialing:\nChina (Mandarin): 400-602-2065 Hong Kong: 800-963-117 United States: +1-855-452-5696 International: +61-2-9003-4211 Replay Passcode: 4495078 Replay End Date: March 22, 2018 About Xunlei\nXunlei Limited (\"Xunlei\") is a leading cloud-based acceleration technology company in China. Xunlei operates a powerful internet platform in China based on cloud computing to provide users with quick and easy access to digital media content through its core products and services, Xunlei Accelerator and the cloud acceleration subscription services. Xunlei is increasingly extending into mobile devices in part through potentially pre-installed acceleration products in mobile phones. Benefitting from the large user base accumulated by Xunlei Accelerator, Xunlei has further developed various value-added services to meet a fuller spectrum of its users' digital media content access and consumption needs.\nSafe Harbor Statement\nThis press release contains statements of a forward-looking nature. These statements are made under the \"safe harbor\" provisions of the U.S. Private Securities Litigation Reform Act of 1995. You can identify these forward-looking statements by terminology such as \"will,\" \"expects,\" \"believes,\" \"anticipates,\" \"future,\" \"intends,\" \"plans,\" \"believes,\" \"estimates\" and similar statements. Among other things, the management's quotations, the \"Outlook\" and \"Guidance\" sections in this press release, as well as the Company's strategic, operational and acquisition plans, contain forward-looking statements. These forward-looking statements involve known and unknown risks and uncertainties and are based on current expectations, assumptions, estimates and projections about the Company and the industry. Forward-looking statements involve inherent risks and uncertainties, including but not limited to: the Company's ability to continue to innovate and provide attractive products and services to retain and grow its user base; the Company's ability to keep up with technological developments and users' changing demands in the internet industry; the Company's ability to convert its users into subscribers of its premium services; the Company's ability to deal with existing and potential copyright infringement claims and other related claims; the Company’s ability to react to the governmental actions for its scrutiny of internet content in China and the Company's ability to compete effectively. Although the Company believes that the expectations expressed in these forward-looking statements are reasonable, it cannot assure you that its expectations will turn out to be correct, and investors are cautioned that actual results may differ materially from the anticipated results. Further information regarding risks and uncertainties faced by the Company is included in the Company's filings with the U.S. Securities and Exchange Commission. All information provided in this press release is as of the date of the press release, and the Company undertakes no obligation to update any forward-looking statements to reflect subsequent occurring events or circumstances, or changes in its expectations, except as may be required by law.\nAbout Non-GAAP Financial Measures\nTo supplement Xunlei's consolidated financial results presented in accordance with United States Generally Accepted Accounting Principles (\"GAAP\"), Xunlei uses the following measures defined as non-GAAP financial measures by the United States Securities and Exchange Commission: (1) non-GAAP operating income/(loss), (2) non-GAAP net income/(loss) from continuing operations, (3) non-GAAP basic and diluted earnings per share for common shares attributable to continuing operations, and (4) non-GAAP basic and diluted earnings per ADS attributable to continuing operations. The presentation of the non-GAAP financial information is not intended to be considered in isolation or as a substitute for the financial information prepared and presented in accordance with GAAP.\nXunlei believes that these non-GAAP financial measures provide meaningful supplemental information to investors regarding the Company’s operating performance by excluding share-based compensation expenses, which is not expected to result in future cash payments. These non-GAAP financial measures also facilitate management's internal comparisons to Xunlei's historical performance and assist the Company’s financial and operational decision making. A limitation of using these non-GAAP financial measures is that these non-GAAP measures exclude share-based compensation charge that has been and will continue to be for the foreseeable future a significant recurring expense in Xunlei’s results of operations. Management compensates for these limitations by providing specific information regarding the GAAP amounts excluded from each non-GAAP measure. The accompanying reconciliation tables at the end of this release include details on the reconciliations between GAAP financial measures that are most directly comparable to the non-GAAP financial measures the Company has presented.\nXUNLEI LIMITED UNAUDITED CONDENSED CONSOLIDATED BALANCE SHEETS (Amounts expressed in thousands of USD, except for share, per share (or ADS) data) D e c ember 3 1 , December 31, 2017 2016 US$ US$ Assets Current assets: Cash and cash equivalents 233,479 199,504 Short-term investments 138,915 181,960 Accounts receivable, net 40,632 14,536 Inventories 3,879 374 Deferred tax assets - 1,221 Due from related parties 6,986 1,097 Prepayments and other current assets 6,866 13,593 Held-for-sale assets 26 20 Total current assets 430 , 783 412, 305 Non-current assets: Long-term investments 42,741 40,792 Deferred tax assets 6,072 3,272 Property and equipment, net 24,685 20,996 Intangible assets, net 5,511 10,746 Goodwill 21,760 20,497 Other long-term prepayments and receivables 1,885 1,187 Total assets 533 , 437 509,795 Liabilities Current liabilities: Accounts payable 49,819 33,376 Due to a related party 10 45 Deferred revenue and income, current portion 28,046 23,194 Income tax payable 3,128 2,321 Accrued liabilities and other payables 59,871 33,131 Held-for-sale liabilities 822 1,338 Total current liabilities 1 41 , 696 93,405 Non-current liabilities: Deferred revenue and income 3,242 4,082 Deferred tax liability, non-current portion - 635 Due to related parties, non-current portion 4,737 4,537 Other long-term payable 925 886 Total liabilities 1 50 , 600 103,545 Equity Common shares (USD0.00025 par value, 1,000,000,000\nshares authorized, 368,877,209 shares issued and\n330,545,000 shares outstanding as at December 31, 2016;\n368,877,209 issued and 333,643,560 shares outstanding\nas at December 31, 2017) 83 83 Additional paid-in-capital 461,330 453,347 Accumulated other comprehensive loss (7,031 ) (13,629 ) Statutory reserves 5,132 5,132 Treasury shares (38,332,209 shares and 35,233,649 shares as at December 31,\n2016 and December 31, 2017, respectively) 9 9 Accumulated deficits (74,526 ) (36,704 ) Total Xunlei Limited's shareholders' equity 384,997 408,238 Non-controlling interests (2,160 ) (1,988 ) Total liabilities and shareholders' equity 533 , 437 509,795\nXUNLEI LIMITED Unaudited Condensed Consolidated Statements of Income (Amounts expressed in thousands of USD, except for share, per share (or ADS) data) Three months ended\nTwelve months ended\nDec 31, Sept 30, Dec 31, Dec 31, Dec 31, 201 7 201 7 201 6 201 7 201 6 US$ US$ US$ US$ US$ Revenues, net of rebates and discounts 82,416 44,810 36,065 201,911 140,985 Business taxes and surcharges (702 ) (256 ) (214 ) (1,328 ) (779 ) Net revenues 81,714 44,554 35,851 200,583 140,206 Cost of revenues (41,983 ) (28,650 ) (20,148 ) (117,876 ) (79,928 ) Gross profit 39,731 15,904 15,703 82,707 60,278 Operating expenses Research and development expenses (20,558 ) (15,497 ) (17,157 ) (66,947 ) (61,169 ) Sales and marketing expenses (7,486 ) (5,456 ) (4,260 ) (19,888 ) (14,601 ) General and administrative expenses (7,744 ) (13,216 ) (6,123 ) (36,517 ) (26,010 ) Impairment of assets - (13,556 ) - (13,556 ) - Total operating expenses (35,788 ) (47,725 ) (27,540 ) (136,908 ) (101,780 ) Operating (loss)/income 3,943 (31,821 ) (11,837 ) (54,201 ) (41,502 ) Interest income 460 399 448 1,967 2,158 Interest expense (60 ) (60 ) (60 ) (239 ) (239 ) Other income/(loss), net 833 2,068 1,642 7,880 6,502 Share of income/(loss) from equity investee (1,567 ) (75 ) (187 ) (1,875 ) (194 ) (Loss) / Income from continuing operations before income taxes 3,609 (29,489 ) (9,994 ) (46,468 ) (33,275 ) Income tax (expense)/benefit (560 ) 2,728 1,518 2,252 2,469 Net (loss) / income from continuing operations 3,049 (26,761 ) (8,476 ) (44,216 ) (30,806 ) Discontinued operations (Loss) / gain from discontinued operations before income taxes 1,279 1,419 1,748 7,538 7,791 Income tax benefit/(expense) (192 ) (213 ) (269 ) (1,131 ) (1,168 ) Net income from discontinued operations 1,087 1,206 1,479 6,407 6,623 Net (loss)/income 4,136 (25,555 ) (6,997 ) (37,809 ) (24,183 ) Less: net profit/(loss) attributable to non-controlling interest (4 ) 5 (33 ) 13 (72 ) Net (loss)/income attributable to common shareholders 4,140 (25,560 ) (6,964 ) (37,822 ) (24,111 )\nEarnings/(loss) per share for common shares, basic Continuing operations 0.0092 (0.0805 ) (0.0256 ) (0.1333 ) (0.0919 ) Discontinued operations 0.0033 0.0036 0.0045 0.0193 0.0198 Total earnings/(loss) per share for common shares, basic 0.0125 (0.0769 ) (0.0211 ) (0.1140 ) (0.0721 ) Earnings/(loss) per share for common shares, diluted Continuing operations 0.0090 (0.0805 ) (0.0256 ) (0.1333 ) (0.0919 ) Discontinued operations 0.0032 0.0036 0.0045 0.0193 0.0198 Total earnings/(loss) per share for common shares, diluted 0.0122 (0.0769 ) (0.0211 ) (0.1140 ) (0.0721 ) Earnings/(loss) per ADS, basic Continuing operations 0.0460 (0.4027 ) (0.1279 ) (0.6665 ) (0.4596 ) Discontinued operations 0.0163 0.0182 0.0224 0.0966 0.0991 Total earnings/(loss) per ADS, basic 0.0623 (0.3845 ) (0.1055 ) (0.5699 ) (0.3605 ) Earnings/(loss) per ADS, diluted Continuing operations 0.0450 (0.4027 ) (0.1279 ) (0.6665 ) (0.4596 ) Discontinued operations 0.0161 0.0182 0.0224 0.0966 0.0991 Total earnings/(loss) per ADS, diluted 0.0611 (0.3845 ) (0.1055 ) (0.5699 ) (0.3605 ) Weighted average number of common shares\nused in calculating continuing operations: Basic 332,986,916 332,273,676 330,397,477 331,731,963 334,155,668 Diluted 338,685,290 332,273,676 330,397,477 331,731,963 334,155,668 Weighted average number of ADSs\nused in calculating continuing operations : Basic 66,597,383 66,454,735 66,079,495 66,346,393 66,831,134 Diluted 67,737,058 66,454,735 66,079,495 66,346,393 66,831,134 XUNLEI LIMITED Reconciliation of GAAP and Non-GAAP Results (Excluding discontinued operations) (Amounts expressed in thousands of USD, except for share, per share (or ADS) data) Three months ended\nTwelve months ended\nDec 31, Sept 30, Dec 31, Dec 31, Dec 31, 201 7 201 7 201 6 201 7 201 6 US$ US$ US$ US$ US$ GAAP operating (loss)/income 3,943 (31,821 ) (11,837 ) (54,201 ) (41,502 ) Share-based compensation expenses 1,718 2,108 2,543 8,318 9,336 Non-GAAP operating (loss)/ income 5 , 661 (29, 71 3 ) ( 9 , 2 94 ) ( 45 , 883 ) ( 3 2 , 1 66 ) GAAP net (loss)/income from continuing operations 3,049 (26,761 ) (8,476 ) (44,216 ) (30,806 ) Share-based compensation expenses 1,718 2,108 2,543 8,318 9,336 Non-GAAP net (loss)/income from continuing operations 4,767 ( 24 ,6 5 3 ) ( 5 , 9 33 ) ( 35 , 898 ) ( 2 1, 4 70 ) GAAP earnings/(loss) per share for common shares attributable to continuing operations: Basic 0.0092 (0.0805 ) (0.0256 ) (0.1333 ) (0.0919 ) Diluted 0.0090 (0.0805 ) (0.0256 ) (0.1333 ) (0.0919 ) GAAP earnings/(loss) per ADS attributable to continuing operations: Basic 0.0460 (0.4027 ) (0.1279 ) (0.6665 ) (0.4596 ) Diluted 0.0450 (0.4027 ) (0.1279 ) (0.6665 ) (0.4596 ) Non-GAAP earnings/(loss) per share for common shares attributable to continuing operations: Basic 0.0143 (0.0742 ) (0.0179 ) (0.1083 ) (0.0640 ) Diluted 0.0141 (0.0742 ) (0.0179 ) (0.1083 ) (0.0640 ) Non-GAAP earnings/(loss) per ADS attributable to continuing operations: Basic 0.0715 (0.3710 ) (0.0895 ) (0.5415 ) (0.3200 ) Diluted 0.0705 (0.3710 ) (0.0895 ) (0.5415 ) (0.3200 ) Weighted average number of common shares used in calculating: Basic 332,986,916 332,273,676 330,397,477 331,731,963 334,155,668 Diluted 338,685,290 332,273,676 330,397,477 331,731,963 334,155,668 Weighted average number of ADSs used in calculating: Basic 66,597,383 66,454,735 66,079,495 66,346,393 66,831,134 Diluted 67,737,058 66,454,735 66,079,495 66,346,393 66,831,134 CONTACT: IR Contact:\nXunlei Limited\nEmail: ir@xunlei.com\nTel: +86 755 8633 8443\nWebsite: http://ir.xunlei.com\n1 Due to the strategic shift of our operations, we entered into agreement to sell our web game business in December 2017. According to applicable accounting standards, assets and liabilities related to web game business, including comparatives, are reclassified as assets/liabilities held for sale, while the result related to web game business, including comparatives, are reported as discontinued operations. Figures presented in this earning release are related to continuing operations only and exclude results from web game business unless indicated otherwise. We believe the disposal can let us better arrange our internal resources and focus on the Company’s current strategy.\n2 The calculation is based on the number of users who can assess our premium acceleration services, including accounts temporarily suspended but excluding sub-accounts and accounts on a trial basis. In order to promote customer loyalty, we may elevate the VIP levels of our subscribers if they actively engage in our services, for example, frequently participating in reviewing and rating of our products. Once upgraded to certain higher VIP levels, our subscribers may be offered additional independent accounts, internally termed as sub-accounts. Such sub-accounts allow users to access to our premium acceleration services, at no additional charges. Average revenues per subscriber refer to subscription revenues for the quarter divided by the number of subscriber as of the quarter end.\nSource:Xunlei Limited", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/5103eb2b-d7e4-4963-bf3b-de68ad57435c"], "published": "2018-03-15T03:00:00.000+02:00", "crawled": "2018-03-15T03:57:08.054+02:00", "highlightTitle": ""}