{"organizations": [], "uuid": "7f098bb9c3897a0bd71c120ee3a0c075e9941912", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/03/14/globe-newswire-healthier-choices-management-corp-reports-fourth-quarter-2017-financial-results-and-full-year-fiscal-2017-results.html", "country": "US", "domain_rank": 767, "title": "Healthier Choices Management Corp. Reports Fourth Quarter 2017 Financial Results Full Year Fiscal 2017 Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-15T00:30:00.000+02:00", "replies_count": 0, "uuid": "7f098bb9c3897a0bd71c120ee3a0c075e9941912"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/03/14/globe-newswire-healthier-choices-management-corp-reports-fourth-quarter-2017-financial-results-and-full-year-fiscal-2017-results.html", "ord_in_thread": 0, "title": "Healthier Choices Management Corp. Reports Fourth Quarter 2017 Financial Results Full Year Fiscal 2017 Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "fla.", "sentiment": "none"}], "organizations": [{"name": "healthier choices management corp", "sentiment": "neutral"}, {"name": "hcmc", "sentiment": "none"}, {"name": "healthier choices management corp.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Delivers a $6.0M Improvement in Adjusted EBITDA for Fiscal Year 2017\nHOLLYWOOD, Fla., March 14, 2018 (GLOBE NEWSWIRE) -- Healthier Choices Management Corp. (OTC Pink:HCMC) today announced financial results for the fourth quarter and year ended December 31, 2017.\nFourth Quarter and Full Year Fiscal 2017 Results and Recent Highlights:\nNet sales from continued operations for the year ended December 31, 2017 amounted to $13.0 million, compared to $10.6 million during the same period last year. Fourth quarter same store sales grew by 1.5% year-over-year. Gross profit from continued operations increased by over $1 million for the year, resulting in a year-end amount of $6.3 million, compared to $5.2 million for the same period last year. Operating expenses as a percentage of sales decreased 14% in the fourth quarter versus prior year. For the year ended December 31, 2017, operating expenses as a percentage of sales decreased 6%, reflecting continued reduction of corporate administrative expenses.\nAdjusted EBITDA for the fourth quarter improved approximately $2.5 million compared to the same period in the prior year and improved $6.0 million for the full year ended December 31, 2017.\nJeffrey Holman, Chairman and Chief Executive Officer of Healthier Choices Management Corp., said, “We are delighted with our performance in the fourth quarter and especially proud of our remarkable improvement in our adjusted EBITDA results for the year. The team has continued to execute on the strategic vision for our company.” Mr. Holman went on to comment, “Our team remains focused on the commitment to improve the fundamentals of the business.”\nAbout Healthier Choices Management Corp.\nHealthier Choices Management Corp. is a holding company focused on providing consumers with healthier daily choices with respect to nutrition and other lifestyle alternatives. One segment of our business is our natural and organic grocery operations in Ft. Myers, Florida. The other segment is a U.S. based retailer of vaporizers and e-liquids. Healthier Choices Management Corp. sells direct to consumer via company-owned brick-and-mortar retail locations operating under \"Ada's Natural Market\" and \"The Vape Store\" brands.\nHealthier Choices Management Corp. Inc. ( www.Healthier Choices Management Corp.com ).\nForward Looking Statements.\nThis press release contains forward looking statements within the meaning of that term in the Private Securities Litigation Reform Act of 1995 (Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934). Additional written or oral forward looking statements may be made by the Company from time to time in filings with the Securities and Exchange Commission or otherwise. Statements contained in this press release that are not historical facts are forward looking statements made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995, and are based on management's estimates, assumptions and projections and are not guarantees of future performance. The Company assumes no obligation to update these statements. Forward looking statements may include, but are not limited to, projections or estimates of revenue, income or loss, exit costs, cash flow needs and capital expenditures, statements regarding future operations, expansion or restructuring plans, including our recent exit from and winding down of our wholesale distribution operations. In addition, when used in this release, the words \"anticipates,\" \"believes,\" \"estimates,\" \"expects,\" \"intends,\" and \"plans\" and variations thereof and similar expressions are intended to identify forward looking statements.\nOther factors that may affect our future results of operations and financial condition include, but are not limited to, unanticipated developments in any one or more of the following areas, as well as other factors which may be detailed from time to time in our Securities and Exchange Commission filings: risks involved with our business, including possible loss of business and customer dissatisfaction\nResults of Operations\nThe following table sets forth our Condensed Consolidated Statements of Continuing Operations for the Quarter and Twelve-months ended December 31, 2017 and 2016:\nHEALTHIER CHOICES MANAGEMENT CORP. CONSOLIDATED STATEMENTS OF OPERATIONS Three Months Ended Twelve Months Ended December 31, December 31, 2017 2016 2017 2016 Total sales, net $ 3,212,353 $ 3,166,021 $ 12,961,095 $ 10,565,163 Total cost of sales 1,686,065 1,638,223 6,682,314 5,331,810 GROSS PROFIT 1,526,288 1,527,798 6,278,781 5,233,353 Total operating expenses 4,272,706 4,652,668 16,555,638 14,095,621 LOSS FROM OPERATIONS (2,746,418 ) (3,124,870 ) (10,276,857 ) (8,862,268 ) Total other income (expense), net 185,386 34,411,022 133,446 21,136,563 NET INCOME (LOSS) FROM CONTINUING OPERATIONS $ (2,561,032 ) $ 31,286,152 $ (10,143,411 ) $ 12,274,295 See non-GAAP financial measure discussion Three Months Ended Twelve Months Ended December, December 31, 2017 2016 2017 2016 Adjusted EBITDA Loss from continuing operations $ (2,746,418 ) $ (3,124,870 ) $ (10,276,857 ) $ (8,862,268 ) Depreciation and amortization 89,191 150,616 350,647 374,388 Stock compensation 2,158,341 13,636 7,496,849 75,430 Adjusted EBITDA $ (498,886 ) $ (2,960,618 ) $ (2,429,361 ) $ (8,412,450 )\nConsolidated Balance Sheets\nThe following table sets forth our Condensed Consolidated Balance Sheets for the periods ended December 31, 2017 and December 31, 2016:\nHEALTHIER CHOICES MANAGEMENT CORP. CONSOLIDATED BALANCE SHEETS December 31, 2017 December 31, 2016 ASSETS CURRENT ASSETS Cash and cash equivalents $ 7,883,191 $ 13,366,272 Other current assets 1,070,619 950,753 TOTAL CURRENT ASSETS 8,953,810 14,317,025 Other assets 2,747,595 2,917,726 TOTAL ASSETS $ 11,701,405 $ 17,234,751 LIABILITIES AND STOCKHOLDERS’ EQUITY CURRENT LIABILITIES Other current liabilities $ 1,052,710 $ 1,353,316 Derivative liabilities – warrants 10,231,697 12,868,079 Current liabilities from discontinued operations - 555,810 TOTAL CURRENT LIABILITIES 11,284,407 14,777,205 Other liabilities 10,459 - TOTAL LIABILITIES 11,294,866 14,777,205 TOTAL STOCKHOLDERS’ EQUITY 406,539 2,457,546 TOTAL LIABILITIES AND STOCKHOLDERS’ EQUITY $ 11,701,405 $ 17,234,751 Non-GAAP – Financial Measure\nThe following discussion and analysis contains a non-GAAP financial measure. Generally, a non-GAAP financial measure is a numerical measure of a company’s performance, financial position or cash flows that either excludes or includes amounts that are not normally included or excluded in the most directly comparable measure calculated and presented in accordance with generally accepted accounting principles (GAAP). Non-GAAP financial measures should be viewed as supplemental to, and should not be considered as alternative to, net income, operating income, and cash flow from operating activities, liquidity or any other financial measures. Non-GAAP financial measures may not be indicative of the historical operating results of the Company nor are they intended to be predictive of potential future financial results. Investors should not consider non-GAAP financial measures in isolation or as substitutes for performance measures calculated in accordance with GAAP.\nManagement believes stockholders benefit from referring to the Adjusted EBITDA in planning, forecasting, and analyzing future periods. Management uses this non-GAAP financial measure in evaluating its financial and operational decision making and as a means of evaluating period to period comparison.\nWe define Adjusted EBITDA as net loss from operations adjusted for non-cash charges from depreciation and amortization and stock compensation. Management believes Adjusted EBITDA is an important measure of our operating performance because it allows management, investors and analysts to evaluate and assess our core operating results from period to period after removing the impact of significant non-cash charges that effect comparability between reporting periods. Our management recognizes that Adjusted EBITDA has inherent limitations because of the excluded items.\nWe have included a reconciliation of our non-GAAP financial measure to loss from operations as calculated in accordance with GAAP. We believe that providing the non-GAAP financial measure, together with the reconciliation to GAAP, helps investors make comparisons between the Company and other companies. In making any comparisons to other companies, investors need to be aware that companies use different non-GAAP measures to evaluate their financial performance. Investors should pay close attention to specific definitions being used and to the reconciliation between such measures and the corresponding GAAP measures provided by each company under applicable rules of the Securities and Exchange Commission (“SEC”).\n3800 North 28TH Way, #1 | Hollywood, FL 33020 | O: 305-600-5004 / F: 954-272-7773\nSource: Healthier Choices Management Corp", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/599cf386-fd17-4522-be12-9c23bfa31f14", "https://www.globenewswire.com/Tracker?data=3umm0xXC3KNCW7DX5FIGuvbqbXrq7XVJlW8jwV_2nPwRTKhoAz1KJrKW-n8jSAGccnLdXwv3P9wfSUMgTiBtxE4pbT9aCFvjTJO7HmCfJNsQDQerq4ITc6Ezd75iDuHu"], "published": "2018-03-15T00:30:00.000+02:00", "crawled": "2018-03-15T01:01:01.000+02:00", "highlightTitle": ""}